app/controllers/songs_controller.rb

  def index

    if params[:artist_id]
      if Artist.find_by_id(params[:artist_id]) == nil
        redirect_to artists_path, alert: "Artist not found."#redirect_to artist_path, alert: "Artist not found."
      else #Artist.find_by_id(params[:artist_id]) #!= nil
        @songs = Artist.find_by_id(params[:artist_id]).songs
        #binding.pry
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "id"."id" = ? LIMIT ?  [["id", "5"], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT  "artists".* FROM "artists" WHERE (8) LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      @a = Artist.find_by_id(params[:artist_id])
      @song =  @a.songs.find_by_id(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]